package ru.job4j.ood.isp.menu;

/**
 * 6. Создайте класс TodoApp - консольное приложение, которое позволяет:
 * Добавить элемент в корень меню;
 * Добавить элемент к родительскому элементу;
 * Вызвать действие, привязанное к пункту меню (действие можно сделать константой,
 * например, ActionDelegate DEFAULT_ACTION = () -> System.out.println("Some action") и указывать при добавлении элемента в меню);
 * Вывести меню в консоль.
 */
public class TodoApp {
    ActionDelegate DEFAULT_ACTION = () -> System.out.println("Some action");




}
